Repository: NirvanaEx/safesky
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Language
uz: Til

source: Theme
uz: Mavzui

source: Dark
uz: Qorong'i

source: Light
uz: Yorqin

source: Russian
uz: Rus

source: English
uz: Ingliz

source: Uzbek
uz: O'zbek

source: Version
uz: Vesriya

source: User agreement
uz: Foydalanuvchi kelishuvi

source: Privacy policy
uz: Maxfiylik siyosati

source: Confirmed
uz: Tasdiqlangan

source: Pending
uz: Kutilmoqda

source: Rejected
uz: Rad etilgan

source: Canceled
uz: Bekor qilingan

source: Unknown
uz: Noma'lum

source: Error retrieving status
uz: Statusni olishda xato

source: Latitude
uz: Kenglik

source: Longitude
uz: Uzunlik

source: Notifications
uz: Bildirishnomalar

source: No notifications
uz: Bildirishnomalar yo'q

source: News
uz: Yangiliklar

# noNews
source: No news available.
uz: Yangiliklar yo'q.

# tokenPreExpirationTitle
source: Attention
uz: Diqqat

# tokenPreExpirationMessage
source: Account re-login required in 5 minutes
uz: 5 daqiqadan so'ng akkauntga qayta kirish talab qilinadi

# tokenFinalTitle
source: Logged Out
uz: Chiqib ketdingiz

# tokenFinalMessage
source: You have been logged out of your account
uz: Siz akkauntingizdan chiqib ketdingiz

# loginView_loginToAccount
source: Log in to your account
uz: Akkauntizga kiring

# loginView_email
source: Email
uz: Elektron pochta

# loginView_password
source: Password
uz: Parol

# loginView_login
source: Login
uz: Kirish

# loginView_register
source: Register
uz: Ro‘yxatdan o‘tish

# emailView_register
source: Register
uz: Ro‘yxatdan o‘tish

# emailView_email
source: Email
uz: Elektron pochta

# emailView_continueLabel
source: Continue
uz: Davom etish

# emailView_alreadyHaveAccount
source: Already have an account? Log in
uz: Allaqachon hisobingiz bormi? Kirish

# emailView_invalidEmailFormat
source: Invalid email format
uz: Email formati noto‘g‘ri

# emailView_termsOfService
source: By clicking 'Continue', you accept the Terms of Service
uz: 'Davom etish' tugmasini bosish orqali siz foydalanish shartlariga rozilik bildirasiz

# infoView_register
source: Register
uz: Ro‘yxatdan o‘tish

# infoView_createPassword
source: Create a password
uz: Parol yarating

# infoView_repeatPassword
source: Repeat the password
uz: Parolni takrorlang

# infoView_confirmationCode
source: Confirmation code
uz: Tasdiqlash kodi

# infoView_surname
source: Surname
uz: Familiya

# infoView_name
source: Name
uz: Ism

# infoView_phone
source: Phone
uz: Telefon

# infoView_verificationSent
source: We have sent a verification code to
uz: Biz tasdiqlash kodini quyidagi raqamga yubordik:

# infoView_acceptTerms
source: By clicking 'Continue', you accept the Terms of Service
uz: 'Davom etish' tugmasini bosish orqali siz foydalanish shartlariga rozilik bildirasiz

# mainView_requests
source: Requests
uz: So‘rovlar

# mainView_add
source: Add
uz: Qo‘shish

# mainView_scan
source: Scan
uz: Skanerlash

# mainView_profile
source: Profile
uz: Profil

# mainView_hi
source: Hi
uz: Salom

# mainView_support
source: Support
uz: Qo‘llab-quvvatlash

# mainView_settings
source: Settings
uz: Sozlamalar

# mainView_aboutApp
source: About app
uz: Ilova haqida

# mainView_logout
source: Logout
uz: Chiqish

# mainView_available24
source: Operators available 24/7
uz: Operatorlar 24/7 xizmatda

# profileView_profile
source: Profile
uz: Profil

# profileView_surname
source: Surname
uz: Familiya

# profileView_name
source: Name
uz: Ism

# profileView_phone
source: Phone
uz: Telefon

# profileView_password
source: Password
uz: Parol

# profileView_changePassword
source: Change password
uz: Parolni o'zgartirish

# profileView_oldPassword
source: Old password
uz: Eski parol

# profileView_newPassword
source: New password
uz: Yangi parol

# profileView_confirmPassword
source: Confirm password
uz: Parolni tasdiqlash

# profileView_successChangedPassword
source: Password successfully changed
uz: Parol muvaffaqiyatli o'zgartirildi

# profileView_save
source: Save
uz: Saqlash

# profileView_change
source: Change
uz: O'zgartirish

# profileView_submitRequest
source: Submit Request
uz: Arizani yuborish

# profileView_passwordChanged
source: Your password has been changed successfully.
uz: Parolingiz muvaffaqiyatli o'zgartirildi.

# profileView_profileUpdated
source: Profile updated successfully.
uz: Profil muvaffaqiyatli yangilandi.

# requestListView_search
source: Search
uz: Qidiruv

# requestListView_noDataFound
source: No data found
uz: Ma’lumot topilmadi

# settingsView_save
source: Save
uz: Saqlash

# scanView_scanMessage
source: Please scan the QR code
uz: Iltimos, QR-kodni skaner qiling

# scanView_errorFetchingData
source: Error fetching data
uz: Ma'lumotni olishda xato

# scanView_authTokenNotFound
source: Authentication token not found
uz: Autentifikatsiya tokeni topilmadi

# scanView_back
source: Back
uz: Orqaga

# scanView_stopExistingLocationSharing
source: Stop Existing Location Sharing?
uz: Mavjud joylashuv ulashish vazifasini to'xtatilsinmi?

# scanView_locationSharingActive
source: Stop Existing Location Sharing?
uz: Joylashuv ulashish vazifasi allaqachon faollashtirilgan. Uni to'xtatib, yangisini boshlashni xohlaysizmi?

# scanView_continue
source: Continue
uz: Davom etish

# addRequestView_other
source: Other
uz: Boshqa

# addRequestView_operatorPhone
source: Operator's phone number
uz: Operatorning telefon raqami

# addRequestView_additionalPhone
source: Additional phone number
uz: Qo'shimcha telefon raqami

# addRequestView_addPhone
source: Add phone number
uz: Telefon raqamini qo'shish

# addRequestView_flightPurpose
source: Flight purpose
uz: Parvoz maqsadi

# addRequestView_enterPurpose
source: Enter flight purpose
uz: Parvoz maqsadini kiriting

# addRequestView_flightPurposeHint
source: Flight purpose
uz: Parvoz maqsadi

# addRequestView_applicationNum
source: Application Number
uz: Ariza raqami

# addRequestView_chooseOperator
source: Choose Operator
uz: Operatorlarni tanlash

# addRequestView_chooseOneOrMultiple
source: Choose one or multiple
uz: Bitta yoki bir nechta tanlang

# addRequestView_selectOperator
source: Select Operator
uz: Operatorni tanlang

# addRequestView_selectBpla
source: Select BPLA
uz: BPLA ni tanlang

# addRequestView_chooseBpla
source: Choose BPLA
uz: BPLA ni tanlash

# addRequestView_flightStartDate
source: Flight Start Date
uz: Parvoz boshlanish sanasi

# addRequestView_requesterName
source: Requester Name
uz: So'rovchi ismi

# addRequestView_flightSign
source: Flight Sign
uz: Parvoz belgisi

# addRequestView_flightTimes
source: Flight Times (UTC)
uz: Parvoz vaqtlari (UTC)

# addRequestView_region
source: Region
uz: Hudud

# addRequestView_landmark
source: Flight Operation Landmark
uz: Parvozlarni amalga oshirish yo'nalishi

# addRequestView_flightOperationArea
source: Flight Operation Area
uz: Parvozlarni amalga oshirish hududi

# addRequestView_flightOperationDistrict
source: Flight Operation District
uz: Parvozlarni amalga oshirish tumani

# addRequestView_routeType
source: Route Type
uz: Marshrut turi

# addRequestView_routeCircle
source: Circle
uz: Aylana bo‘yicha

# addRequestView_routePolygon
source: Polygon
uz: Kvadrat/Poligon bo‘yicha

# addRequestView_routeLine
source: Line
uz: Chiziq bo‘yicha

# addRequestView_coordinates
source: Coordinates
uz: Koordinatalar

# addRequestView_map
source: Map
uz: Xarita

# addRequestView_height
source: Flight Height (m)
uz: Parvoz balandligi (m)

# addRequestView_radius
source: Flight Radius (m)
uz: Parvoz radiusi (m)

# addRequestView_operatorName
source: Operator Name
uz: Operator ismi

# addRequestView_flightHeight
source: Flight height (m)
uz: Parvoz balandligi (m)

# addRequestView_flightRadius
source: Flight radius (m)
uz: Parvoz radiusi (m)

# addRequestView_specialPermit
source: Special Permit from MoD
uz: Mudofaa vazirligidan maxsus ruxsat

# addRequestView_permitNumber
source: Permit Number
uz: Ruxsat raqami

# addRequestView_contract
source: Contract Number and Date
uz: Shartnoma raqami va sanasi

# addRequestView_contractNumber
source: Contract Number
uz: Shartnoma raqami

# addRequestView_optional
source: Optional Note
uz: Ixtiyoriy izoh

# addRequestView_note
source: Note (optional)
uz: Izoh (ixtiyoriy)

# addRequestView_submit
source: Submit
uz: Yuborish

# addRequestView_cancel
source: Cancel request
uz: So'rovni bekor qilish

# addRequestView_stopExistingLocationSharing
source: Stop Existing Location Sharing?
uz: Mavjud joylashuv ulashish vazifasini to'xtatilsinmi?

# addRequestView_locationSharingActive
source: A location sharing task is already active. Would you like to stop it and start a new one?
uz: Joylashuv ulashish vazifasi allaqachon faollashtirilgan. Uni to'xtatib, yangisini boshlashni xohlaysizmi?

# addRequestView_back
source: Back
uz: Orqaga

# addRequestView_delete
source: Delete
uz: O'chirish

# addRequestView_cancelRequest
source: Cancel Request
uz: So‘rovni bekor qilish

# addRequestView_enterReason
source: Enter reason for cancellation
uz: Bekor qilish sababini kiriting

# addRequestView_exit
source: Exit
uz: Chiqish

# addRequestView_planIdMissing
source: Plan ID is missing
uz: Reja ID si mavjud emas

# addRequestView_requestDeletedSuccessfully
source: Request deleted successfully
uz: So‘rov muvaffaqiyatli o‘chirildi

# addRequestView_requestCanceledSuccessfully
source: Request canceled successfully
uz: So‘rov muvaffaqiyatli bekor qilindi

# addRequestView_errorMessage
source: Error: {errorMessage}
uz: Xatolik: {errorMessage}

# addRequestView_invalidRadius
source: Invalid radius value
uz: Radius qiymati noto'g'ri

# addRequestView_invalidFlightHeight
source: Invalid flight height value
uz: Parvoz balandligi qiymati noto'g'ri

# addRequestView_invalidPermitNumber
source: Invalid permit number
uz: Ruxsatnoma raqami noto'g'ri

# addRequestView_invalidContractNumber
source: Invalid contract number
uz: Shartnoma raqami noto'g'ri

# addRequestView_invalidLatLngFormat
source: Invalid coordinates format. Use 'latitude longitude' format
uz: Koordinatalar formati noto'g'ri. Formatni 'kenglik uzunlik' shaklida kiriting

# addRequestView_invalidLatitudeLongitude
source: Invalid values for latitude or longitude
uz: Kenglik yoki uzunlik qiymatlari noto'g'ri

# addRequestView_invalidStartDate
source: Invalid start date
uz: Boshlanish sanasi noto'g'ri

# addRequestView_invalidFlightStartDateTime
source: Invalid flight start date and time
uz: Parvoz boshlanish vaqti noto'g'ri

# addRequestView_invalidFlightEndDateTime
source: Invalid flight end date and time
uz: Parvoz tugash vaqti noto'g'ri

# addRequestView_invalidPermitDate
source: Invalid permit date
uz: Ruxsatnoma sanasi noto'g'ri

# addRequestView_invalidContractDate
source: Invalid contract date
uz: Shartnoma sanasi noto'g'ri

# addRequestView_invalidRequesterName
source: Requester name cannot be empty
uz: Ariza beruvchi nomi bo'sh bo'lishi mumkin emas

# addRequestView_invalidModel
source: Model must be selected
uz: Model tanlanishi kerak

# addRequestView_invalidLandmark
source: The landmark cannot be empty
uz: Parvoz amalga oshirish yo'nalishi bo‘sh bo‘lishi mumkin emas

# addRequestView_invalidPurpose
source: Purpose must be selected
uz: Maqsad tanlanishi kerak

# addRequestView_invalidPhoneNumber
source: Invalid phone number
uz: Noto'g'ri telefon raqami

# addRequestView_invalidEmail
source: Invalid email format
uz: Email formati noto'g'ri

# addRequestView_invalidFlightSign
source: Flight sign must be selected
uz: Parvoz belgisi tanlanishi kerak

# addRequestView_invalidOperatorName
source: Operator name cannot be empty
uz: Operator nomi bo'sh bo'lishi mumkin emas

# addRequestView_invalidBpla
source: Please select at least one BPLA
uz: Iltimos, kamida bitta BPLA ni tanlang

# addRequestView_invalidOperators
source: Please select at least one operator
uz: Iltimos, kamida bitta operatorni tanlang

# addRequestView_invalidApplicationNumber
source: Application number cannot be empty
uz: Ariza raqami bo‘sh bo‘lishi mumkin emas

# addRequestView_invalidDistrict
source: Please select a district
uz: Iltimos, tumanni tanlang

# addRequestView_invalidPolygonPoints
source: Please provide at least 3 points for polygon
uz: Poligon uchun kamida 3 ta nuqta kiriting

# addRequestView_invalidLinePoints
source: Please provide at least 2 points for line
uz: Chiziq uchun kamida 2 ta nuqta kiriting

# addRequestView_requestSentSuccess
source: Request sent successfully!
uz: So'rov muvaffaqiyatli yuborildi!

# addRequestView_sendError
source: Error while sending:
uz: Yuborishda xatolik:

# showRequestView_execState1
source: executing...
uz: bajarilmoqda...

# showRequestView_execState2
source: no signal for more than a minute
uz: bir daqiqadan ortiq signal yo'q

# showRequestView_execState3
source: execution paused
uz: bajarish to'xtatildi

# showRequestView_execState4
source: execution completed
uz: bajarish yakunlandi

# showRequestView_execState5
source: unknown
uz: noma'lum

# showRequestView_execState6
source: execution without tracking
uz: izloviysiz bajarilmoqda

# showRequestView_startLocationSharing
source: Start location sharing
uz: Joylashuv ulashishni boshlash

# showRequestView_requestNum
source: Request Number
uz: Ariza raqami

# showRequestView_chooseOperator
source: Choose Operator
uz: Operatorlarni tanlash

# showRequestView_chooseOneOrMultiple
source: Choose one or multiple
uz: Bitta yoki bir nechta tanlang

# showRequestView_selectOperator
source: Select Operator
uz: Operatorni tanlang

# showRequestView_selectBpla
source: Select BPLA
uz: BPLA ni tanlang

# showRequestView_chooseBpla
source: Choose BPLA
uz: BPLA ni tanlash

# showRequestView_flightStartDate
source: Flight Start Date
uz: Parvoz boshlanish sanasi

# showRequestView_requesterName
source: Requester Name
uz: So'rovchi ismi

# showRequestView_flightSign
source: Flight Sign
uz: Parvoz belgisi

# showRequestView_flightTimes
source: Flight Times (UTC)
uz: Parvoz vaqtlari (UTC)

# showRequestView_region
source: Region
uz: Hudud

# showRequestView_landmark
source: Flight Operation Landmark
uz: Parvozlarni amalga oshirish yo'nalishi

# showRequestView_flightOperationArea
source: Flight Operation Area
uz: Parvozlarni amalga oshirish hududi

# showRequestView_flightOperationDistrict
source: Flight Operation District
uz: Parvozlarni amalga oshirish tumani

# showRequestView_coordinates
source: Coordinates (Location)
uz: Koordinatalar

# showRequestView_map
source: Map
uz: Xarita

# showRequestView_height
source: Flight Height (m)
uz: Parvoz balandligi (m)

# showRequestView_radius
source: Flight Radius (m)
uz: Parvoz radiusi (m)

# showRequestView_flightPurpose
source: Purpose of Flight
uz: Parvoz maqsadi

# showRequestView_operatorName
source: Operator Name
uz: Operator ismi

# showRequestView_operatorPhone
source: Operator Phone
uz: Operator telefoni

# showRequestView_flightHeight
source: Flight height (m)
uz: Parvoz balandligi (m)

# showRequestView_flightRadius
source: Flight radius (m)
uz: Parvoz radiusi (m)

# showRequestView_specialPermit
source: Special Permit from MoD
uz: Mudofaa vazirligidan maxsus ruxsat

# showRequestView_permitNumber
source: Permit Number
uz: Ruxsat raqami

# showRequestView_contract
source: Contract Number and Date
uz: Shartnoma raqami va sanasi

# showRequestView_contractNumber
source: Contract Number
uz: Shartnoma raqami

# showRequestView_optional
source: Optional Note
uz: Ixtiyoriy izoh

# showRequestView_note
source: Note (optional)
uz: Izoh (ixtiyoriy)

# showRequestView_submit
source: Submit
uz: Yuborish

# showRequestView_cancel
source: Cancel request
uz: So'rovni bekor qilish

# showRequestView_stopExistingLocationSharing
source: Stop Existing Location Sharing?
uz: Mavjud joylashuv ulashish vazifasini to'xtatilsinmi?

# showRequestView_locationSharingActive
source: A location sharing task is already active. Would you like to stop it and start a new one?
uz: Joylashuv ulashish vazifasi allaqachon faollashtirilgan. Uni to'xtatib, yangisini boshlashni xohlaysizmi?

# showRequestView_delete
source: Delete
uz: O'chirish

# showRequestView_backDialog
source: Back
uz: Orqaga

# showRequestView_cancelRequestDialog
source: Cancel Request
uz: So‘rovni bekor qilish

# showRequestView_enterReasonDialog
source: Enter reason for cancellation
uz: Bekor qilish sababini kiriting

# showRequestView_exitDialog
source: Exit
uz: Chiqish

# showRequestView_planIdMissing
source: Plan ID is missing
uz: Reja ID si mavjud emas

# showRequestView_requestDeletedSuccessfully
source: Request deleted successfully
uz: So‘rov muvaffaqiyatli o‘chirildi

# showRequestView_requestCanceledSuccessfully
source: Request canceled successfully
uz: So‘rov muvaffaqiyatli bekor qilindi

# showRequestView_errorMessage
source: Error: {errorMessage}
uz: Xatolik: {errorMessage}

# showRequestView_deleteConfirmationTitleDialog
source: Delete Confirmation
uz: O'chirishni tasdiqlash

# showRequestView_deleteConfirmationMessageDialog
source: Do you really want to delete the request?
uz: Siz rostdan ham arizani o'chirmoqchimisiz?

# showRequestView_cancelDialog
source: Cancel
uz: Bekor qilish

# showRequestView_deleteDialog
source: Delete
uz: O'chirish

# showRequestView_fieldEmptyError
source: Field cannot be empty
uz: Maydon bo‘sh bo‘lmasligi kerak

# showRequestView_locationSharingTitle
source: Location sharing
uz: Joylashuvni ulashish

# showRequestView_locationSharingMessage
source: Data sharing is already active. If you press continue, the previous broadcast will be paused.
uz: Ma'lumot ulashish allaqachon boshlangan. Agar davom ettirsangiz, oldingi efir to'xtatiladi.

# showRequestView_locationSharingStarted
source: Location sharing started
uz: Joylashuv ulashish boshlandi

# showRequestView_continue
source: Continue
uz: Davom etish

# mapSelectLocationView_appBarTitle
source: Select Location
uz: Joylashuvni tanlang

# mapSelectLocationView_latitudeHint
source: Latitude
uz: Kenglik

# mapSelectLocationView_longitudeHint
source: Longitude
uz: Uzunlik

# mapSelectLocationView_invalidCoordinates
source: Please enter valid coordinates (latitude: -90 to 90, longitude: -180 to 180)
uz: Iltimos, to'g'ri koordinatalarni kiriting (kenglik: -90 dan 90 gacha, uzunlik: -180 dan 180 gacha)

# mapSelectLocationView_invalidRadius
source: Please enter a valid radius value
uz: Iltimos, to'g'ri radius qiymatini kiriting

# mapSelectLocationView_save
source: Save
uz: Saqlash

# mapShareLocationView_startLocationSharing
source: Start location sharing
uz: Joylashuv ulashishni boshlash

# mapShareLocationView_sharingLocation
source: Sharing location
uz: Joylashuv ulashilmoqda

# mapShareLocationView_stop
source: Stop
uz: To‘xtatish

# mapShareLocationView_pause
source: Pause
uz: Pauza

# mapShareLocationView_resume
source: Resume
uz: Davom ettirish

# mapShareLocationView_paused
source: Paused
uz: To‘xtatilgan

# mapShareLocationView_searchingYourLocation
source: Searching your location
uz: Joylashuvingiz topilmoqda

# mapShareLocationView_confirmStopLocationSharingTitle
source: Stop Location Sharing
uz: Joylashuv ulashishni to‘xtatish

# mapShareLocationView_confirmStopLocationSharingMessage
source: Do you really want to permanently stop the location sharing?
uz: Joylashuv ulashishni yakuniy tarzda to‘xtatishni hohlaysizmi?

# mapShareLocationView_confirmStopLocationSharingYes
source: Yes
uz: Ha

# mapShareLocationView_confirmStopLocationSharingNo
source: No
uz: Yo‘q

# notification_channelName
source: Location Sharing
uz: Joylashuvni ulashish

# notification_channelDescription
source: Notification for location sharing
uz: Joylashuv ulashish uchun bildirishnoma

# notification_activeTitle
source: Location Sharing Active
uz: Joylashuv ulashish faol

# notification_activeBody
source: Your location is being shared
uz: Sizning joylashuvingiz ulashilmoqda

# notification_stopAction
source: Stop Sharing
uz: Ulashishni to'xtatish

# supportView_typeYourMessage
source: Type your message...
uz: Xabaringizni yozing...
